embarquech/cryptnox-pos/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"

# Enough stack for TLS + JSON + crypto operations in app_main
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# mbedTLS certificate bundle for HTTPS RPC endpoints
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# Actually enforce certificate notBefore/notAfter. HAVE_TIME alone only buys
# relative timekeeping (session-ticket expiry) — without HAVE_TIME_DATE
# mbedTLS compiles the date comparison out entirely (x509_crt.c guards the
# BADCERT_EXPIRED/BADCERT_FUTURE block on it), so an expired certificate is
# accepted and the blocking SNTP sync at boot buys nothing.
#
# NOTE: sdkconfig is gitignored and an existing value there WINS over this
# default — delete your sdkconfig (or flip the line by hand) after pulling.
#
# Safe with the current pinning: RPC_CA_CERT_PEM pins the GTS WE1
# intermediate (notAfter = Feb 20 14:00:00 2029 GMT), so server-side leaf
# renewals keep working. Re-pin before Feb 2029 regardless.
CONFIG_MBEDTLS_HAVE_TIME_DATE=y

# HTTPS support in the HTTP client
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y

# Allow up to 3 SNTP servers (multi-server time sync fallback in eth_rpc)
CONFIG_LWIP_SNTP_MAX_SERVERS=3

# CYD ships with a Boya SPI flash chip — link its dedicated driver so IDF
# doesn't fall back to the generic one (silences the boot-time warning)
CONFIG_SPI_FLASH_SUPPORT_BOYA_CHIP=y

# CYD has 4 MB flash — custom table with two 1.94 MB OTA app slots
CONFIG_ESPTOOLPY_FLASHSIZE_2MB=n
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_PARTITION_TABLE_SINGLE_APP=n
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Roll back an update that does not survive its own first boot. The bootloader
# marks a freshly-booted slot PENDING_VERIFY; ota_mark_valid() (main/ota.cpp)
# clears that only once the panel, the NFC reader and the RPC uplink have all
# come up. A panic, a watchdog reset or a failed bring-up before that point
# means the next boot returns to the slot that was working. Without this, one
# bad build bricks a terminal that is no longer on a bench.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Arduino-as-component — auto-start setup()/loop() is NOT used; we call from app_main
CONFIG_AUTOSTART_ARDUINO=n
CONFIG_FREERTOS_HZ=1000

# TFT_eSPI config for CYD ESP32-2432S028R (mirrors esp32-loot's platformio build_flags)
CONFIG_TFT_ILI9341_DRIVER=n
CONFIG_TFT_ILI9341_2_DRIVER=y
CONFIG_TFT_BGR_ORDER=y
CONFIG_TFT_WIDTH=240
CONFIG_TFT_HEIGHT=320
CONFIG_TFT_HSPI_PORT=y
CONFIG_TFT_MISO=12
CONFIG_TFT_MOSI=13
CONFIG_TFT_SCLK=14
CONFIG_TFT_CS=15
CONFIG_TFT_DC=2
# CYD: the panel RESET is hard-wired to the board EN line — no GPIO controls it.
# TFT_eSPI emits "Invalid Reset pin" at build time: expected, the driver falls
# back to software reset (SWRESET).
CONFIG_TFT_RST=-1
CONFIG_ENABLE_BL=y
CONFIG_TFT_BL=21
CONFIG_TFT_BACKLIGHT_ON_HIGH=y
CONFIG_TFT_SPI_FREQUENCY=55000000
CONFIG_TFT_LOAD_GLCD=y
CONFIG_TFT_LOAD_FONT2=y
CONFIG_TFT_LOAD_FONT4=y
CONFIG_TFT_LOAD_FONT6=y
CONFIG_TFT_LOAD_GFXFF=y
CONFIG_TFT_SMOOTH_FONT=y

# ── LVGL (8.x) — UI toolkit, configured here for a reproducible build ──
# TFT_eSPI is used only as the low-level panel driver (flush); LVGL renders.
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_MEM_SIZE_KILOBYTES=48
# Anti-aliased Montserrat font sizes referenced by ui.cpp
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y

# CYD: the XPT2046 touch controller lives on its own SPI bus (CS=33, CLK=25,
# MOSI=32, MISO=39, IRQ=36), driven by the XPT2046_Touchscreen component — NOT
# by TFT_eSPI, whose touch support requires sharing the display bus. The
# build-time "TOUCH_CS pin not defined" warning is expected; do not enable
# CONFIG_ENABLE_TOUCH, it would fight the XPT2046 driver over GPIO 33.

# QR code on the phone-setup screen (provision.cpp).
CONFIG_LV_USE_QRCODE=y
